/**
 * @name 输出目录加载结果
 * @description 每一个依赖被加载后都会被立刻执行，那么如果要争取加载一个依赖，则其子依赖都应该优先被加载
   每一个依赖不希望多出现冗余的情况，若依赖出现多版本的情况，则默认使用更新的版本。
 * @example
- a@0.1.0
    - d@0.2.0
    - c@0.1.0
- b@0.1.1
    - e@0.1.2
    - c@0.1.2
- c@0.2.0

则其中一种输出的依赖优先级排序为：
['d@0.2.0', 'c@0.2.0', 'a@0.1.0', 'e@0.1.2', 'b@0.1.1’]
 */

const data = [
  {
    name: 'a@0.1.0',
    deps: [
      {
        name: 'd@0.2.0',
      },
      {
        name: 'c@0.1.0',
      },
    ],
  },
  {
    name: 'b@0.1.1',
    deps: [
      {
        name: 'e@0.1.2',
      },
      {
        name: 'c@0.1.2',
      },
    ],
  },
  {
    name: 'c@0.2.0',
  },
];
